In [5]:
import seaborn as sns
import matplotlib.pyplot as plt

In [6]:
df = sns.load_dataset('anscombe')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   dataset  44 non-null     object
 1   x        44 non-null     float64
 2   y        44 non-null     float64
dtypes: float64(2), object(1)
memory usage: 1.2+ KB

In [8]:
df.head(2)

  dataset     x     y
0       I  10.0  8.04
1       I   8.0  6.95

In [7]:
df.groupby(['dataset']).nunique()

          x   y
dataset
I        11  11
II       11  11
III      11  11
IV        2  11

In [8]:
df['dataset'].value_counts()

I      11
II     11
III    11
IV     11
Name: dataset, dtype: int64

In [19]:
df.groupby('dataset').mean()

           x         y
dataset
I        9.0  7.500909
II       9.0  7.500909
III      9.0  7.500000
IV       9.0  7.500909

In [20]:
df.groupby('dataset').std()

                x         y
dataset
I        3.316625  2.031568
II       3.316625  2.031657
III      3.316625  2.030424
IV       3.316625  2.030579

In [21]:
df.groupby('dataset').corr()

                  x         y
dataset
I       x  1.000000  0.816421
        y  0.816421  1.000000
II      x  1.000000  0.816237
        y  0.816237  1.000000
III     x  1.000000  0.816287
        y  0.816287  1.000000
IV      x  1.000000  0.816521
        y  0.816521  1.000000

In [24]:
df1 = df[df['dataset']=='I']
df2 = df[df['dataset']=='II']
df3 = df[df['dataset']=='III']
df4 = df[df['dataset']=='IV']

In [25]:
df1

   dataset     x      y
0        I  10.0   8.04
1        I   8.0   6.95
2        I  13.0   7.58
3        I   9.0   8.81
4        I  11.0   8.33
5        I  14.0   9.96
6        I   6.0   7.24
7        I   4.0   4.26
8        I  12.0  10.84
9        I   7.0   4.82
10       I   5.0   5.68